app/controllers/pessoas_controller.rb

SELECT `pessoas`.* FROM `pessoas`
---
  def index
    @pessoas = Pessoa.all

INSERT INTO `pessoas` (`nome`, `telefone`, `created_at`, `updated_at`) VALUES ('t1', '3123-2345', '2015-05-05 00:44:10', '2015-05-05 00:44:10')
---
  def create
    @pessoa = Pessoa.new(pessoa_params)

    respond_to do |format|
      if @pessoa.save

SELECT  `pessoas`.* FROM `pessoas` WHERE `pessoas`.`id` = 1 LIMIT 1
---
    def set_pessoa
      @pessoa = Pessoa.find(params[:id])